'基礎知識'
i = 5
bin(i)
'0b101'  # 5 を 2 進数で表記すると 101
bin(i >> 2)
'0b1'  # 5 を 2 回右にシフトすると 001
print((i >> 2) & 1)
1  # 5 を 2 回右にシフトしたものと 1 の論理積は 1 (=True)

'bit全探索'

money = 300
item = (("みかん", 100), ("りんご", 200), ("ぶどう", 300))
n = len(item)
for i in range(2 ** n):
    bag = []
    total = 0
    for j in range(n):  # このループが一番のポイント
        if ((i >> j) & 1):  # 順に右にシフトさせ最下位bitのチェックを行う
            bag.append(item[j][0])  # フラグが立っていたら bag に果物を詰める
            total += item[j][1]  # 買い物累計額にも加算
    if (total <= money):
        print(total, bag)
'''出力結果
0 []
100 ['みかん']
200 ['りんご']
300 ['みかん', 'りんご']
300 ['ぶどう']
'''

